[
  {
    "id": 1,
    "title": "JavaScript Enlightenment",
    "description": "Коди Линдли (Cody Lindley) позиционирует свою книгу для двух типов людей: для продвинутых начинающих JavaScript-программистов, а также для разработчиков с большим опытом, использующих в основном сторонние библиотеки. С первым типом более-менее понятно, но почему книга подойдёт второму типу? Всё просто. Библиотеки работают по принципу «чёрного ящика»: передал входные данные, получил выходные данные. Однако понимание того, как «ящик» устроен внутри, позволит писать эффективные веб-приложения и даже собственные качественные библиотеки. «JavaScript Enlightenment» — книга о представлении объектов в JS и сопутствующих с ними особенностей: примитивных и сложных значений, наследовании, области видимости переменных и многое другое."
  },
  {
    "id": 2,
    "title": "Секреты JavaScript ниндзя",
    "description": "Книга, написанная опытными JavaScript-разработчиками Джоном Резиг (John Resig), Беэром Бибо (Bear Bibeault) и Иосипом Марас (Josip Maras), позволит окунуться в глубины JavaScript. Благодаря ей вы научитесь писать эффективный код с помощью функций, объектов и замыканий, управлять асинхронным кодом с помощью обещаний, обрабатывать текст с помощью регулярных выражений, а также решать скрытые проблемы при разработке веб-приложений. В отличие от предыдущих книг, «Секреты JavaScript ниндзя» рассматривает достаточно актуальные стандарты языка JavaScript — ES6 и ES7. Поэтому все советы применимы на практике. К тому же, отзывы на эту книгу говорят о том, что она действительно помогла расширить свои знания и решить многие проблемы работы кода."
  },
  {
    "id": 3,
    "title": "Test-Driven JavaScript Development",
    "description": "Ведущий JavaScript-разработчик Кристиан Йохансен (Christian Johansen) написал полноценное руководство по обеспечению качества кода и его покрытия тестами по методике TDD (Test-Driven Development или разработка через тестирование). Книга рассказывает об автоматизированном тестировании на JavaScript и жизненном цикле продукта с использованием примеров реального кода. Поначалу будет трудно освоить TDD, однако следование данной методике позволит улучшить кодовую базу вашего проекта и легко поддерживать её в дальнейшем. Кроме тестирования, в книге описаны некоторые способы оптимизации производительности веб-приложений. Поэтому «Test-Driven JavaScript Development» подойдёт как для тестировщиков, так и для разработчиков и QA-специалистов."
  },
  {
    "id": 4,
    "title": "Building Front-End Web Apps with Plain JavaScript",
    "description": "В этой книге объясняется, как создать веб-приложение на «чистом» JavaScript, то есть без использования сторонних библиотек и фреймворков. Автор Герд Вагнер (Gerd Wagner) уделяет внимание таким аспектам, как проверка данных, перечисления и перечисляющие атрибуты, однонаправленные и двунаправленные связи между типами объектов, подтипы и наследование в иерархиях классов. Также весь материал дополнен полноценными примерами кода, который можно запустить на веб-сервере и исследовать более подробно. «Building Front-End Web Apps with Plain JavaScript» подойдёт как опытным JavaScript-разработчикам, так и программистам, знакомым с ООП по другим языкам (Java, C++ и т.д.)."
  },
  {
    "id": 5,
    "title": "JavaScript. Оптимизация производительности",
    "description": "JavaScript — не самый быстрый язык, поэтому при разработке веб-приложения важно уделить внимание скорости работы кода, ведь долгое время отклика отпугнёт пользователей. Для этого необходимо знать все «узкие» места приложения и оптимизировать их. На помощь придёт книга «JavaScript. Оптимизация производительности» от Николаса Закаса (Nicholas Zakas), создателя open source проекта ESLint, работавшего в компаниях Yahoo! и Box. Приемы и подходы из этой книги охватывают различные аспекты программирования на JavaScript, такие как время выполнения, загрузка, взаимодействие с DOM, жизненный цикл страниц и многие другие. В отзывах об этой книге читатели отмечают разнообразие подходов к оптимизации кода и рекомендуют её в качестве дополнения к другим книгам по языку в целом и по эффективному JavaScript. Материал подойдёт Middle и Senior-разработчикам."
  },
  {
    "id": 6,
    "title": "DOM Enlightenment",
    "description": "Любой JavaScript-разработчик рано или поздно сталкивается с DOM (Document Object Model) — программным интерфейсом, благодаря которому с помощью JS-скриптов можно изменять файлы HTML и XML. Хоть для него существует единый стандарт, но каждый браузер реализует DOM по-разному. Чтобы кто угодно мог разобраться в ворохе документации, Коди Линдли написал книгу «DOM Enlightenment». В ней с помощью минимума слов и максимума примеров реального кода объясняется, как правильно писать DOM-скрипты."
  }
]
